<?php
namespace mia\miagroup\Daemon\Temp;

use mia\miagroup\Service\Knowledge as KnowledgeService;

class Importknowledgelabel extends \FD_Daemon {

    public function execute() {
        $function_name = $this->request->argv[0];
        $this->$function_name();
    }


    //导入知识标签关联数据
    public function setKnowledgeLabel(){
        $knowledgeService = new KnowledgeService();
        
        $params = array(
            7=>array("备孕二胎","好孕报告","流产","生育能力","性生活"),
            8=>array("叶酸","微量元素","中药调理","备孕食谱","备孕饮食禁忌"),
            9=>array("排卵期","性爱姿势","快速怀孕","促排卵","生男生女清宫图"),
            10=>array("妇科检查","宫外孕","染色体检查"),
            11=>array(),
            12=>array("宫寒","妇科疾病","不孕不育症","输卵管不孕","代孕","人工授精","亚健康","多囊卵巢","内分泌失调"),
            13=>array("胎儿发育","羊水穿刺","唐氏筛查","宫外孕","畸形排查","产检","糖耐检查"),
            14=>array("孕期不适","妊娠高血压","妊娠期糖尿病","保胎","感冒","贫血","前置胎盘","胎儿发育迟缓"),
            15=>array("孕期用药","孕期护肤保养","孕妇用品","孕期胎教","孕期睡眠","孕期旅游","孕期运动"),
            16=>array("营养不良","DHA","叶酸","钙铁锌","维生素","孕期营养","饮食禁忌"),
            17=>array("顺产","早产","剖腹产","宫缩","催产","呼吸法"),
            18=>array("母乳喂养","混合喂养","吐奶呛奶","开奶","催奶"),
            19=>array("身体发育指标和特点","常见面部头部生理现象","常见皮肤生理现象","常见其它生理现象"),
            20=>array("新生儿运动和肢体反射能力","新生儿听的能力","新生儿哭的能力","新生儿看的能力","新生儿嗅觉和味觉的能力","新生儿的智力发展"),
            21=>array("与宝宝交流","新生儿哭","新生儿大小便","尿布与纸尿裤","新生儿眼口耳鼻的护理","新生儿皮肤的护理","新生儿洗澡","新生儿抚触","抱新生儿","新生儿三浴","新生儿睡眠","房间和环境","常见护理问题","女婴的护理","不同季节的护理","安全与意外","婴儿肚脐的护理"),
            22=>array("新生儿常见疾病","新生儿用药","新生儿的疫苗接种","先天性疾病","婴儿猝死","新生儿体检检查"),
            23=>array("衣服","纸尿裤","推车","喂养工具","其他"),
            24=>array("早产儿","双胞胎和多胞胎","巨大儿"),
            25=>array("月子禁忌","开奶催乳","饮食禁忌","溢奶","产后抑郁症","产后避孕","照顾新妈妈","关于坐月子的民间说法 月子里的常见问题"),
            26=>array(),
            27=>array(),
            28=>array("关于新生儿民间说法","关于月子民间说法"),
            29=>array("产后可能发生的病症","哺乳期用药","产后检查"),
            30=>array(),
            31=>array("夫妻生活","家庭生活&社会关系","产后抑郁症","美丽新妈妈","新爸爸"),
            32=>array("乳头皲裂","母乳喂养","混合喂养","吐奶呛奶","宝宝营养","宝宝辅食独立吃饭","母乳储存","断奶","背奶","宝宝厌食偏食","宝宝食谱"),
            33=>array("身高体重","长牙","流口水","吃手","说话","睡眠","大脑发育","大运动发育","男宝宝&女宝宝","骨骼","前囟"),
            34=>array("视觉","听觉","嗅觉&味觉","语言能力","动手能力","运动&协调能力","抬头","翻身","站立","行走","认知能力","记忆力","注意力","模仿能力","社交能力","性格&情感","好习惯&坏习惯","男宝宝&女宝宝"),
            35=>array("大小便","洗澡","婴儿抚触按摩","拍嗝","婴儿安全","游泳","婴儿哭闹","婴儿睡眠","理发头发护理","皮肤护理","长牙护理","男宝宝&女宝宝","婴儿指甲的护理","婴儿五官的护理"),
            36=>array("疫苗接种","婴儿常见疾病","婴儿用药"),
            37=>array("衣服","纸尿裤","磨牙棒","玩具","喂养工具","婴儿推车","其他"),
            38=>array("亲子游戏","绘本阅读","性格培养","精细动作","语言教育","宝宝游戏","启蒙游戏","隔代教育","亲子阅读","敏感期"),
            39=>array("两性关系","产后抑郁","婆媳关系","家庭生活","节假日和庆典","新爸爸&新妈妈"),
            40=>array("产后性生活","产后运动","产后瘦身","产后皮肤保养","产后形体恢复","产后检查","重返职场的衣着和化妆"),
            41=>array("产后可能发生的病症","哺乳期用药","产后检查"),
            42=>array("早产儿","双胞胎和多胞胎","巨大儿","发育迟缓","单亲家庭"),
            43=>array(),
            44=>array(),
            45=>array("厌食挑食","DHA","营养饮食","钙铁锌","配方奶粉","维生素","独立吃饭","断奶背奶","宝宝食谱"),
            46=>array("身高体重","说话","学走路","如厕训练","长牙","吃饭训练","性教育"),
            47=>array("刷牙","洗澡","常备药","穿衣","意外伤害","乘车安全","家居安全","睡眠","季节护理","户外活动"),
            48=>array("减少&防止婴幼儿生病","婴幼儿的用药","流行性感冒","婴幼儿疫苗与常见的传染病","婴幼儿常见的其它疾病"),
            49=>array("宝宝看电视","早教","亲子阅读","亲子游戏","儿歌","玩具","亲子关系","精细动作","性格培养"),
            50=>array("儿童牙膏牙刷","儿童鞋","洗护用品","宝宝湿巾","安全座椅","绘本","其他"),
            51=>array("任性","恋物","社交","恐惧心理","物权意识","不喜欢去幼儿园"),
            52=>array("生活自理","习惯培养"),
            53=>array("家庭急救常识","常见的意外事故&救护","不同部位的意外&救护","安全防护"),
            54=>array("骨骼发育","身体身高","换牙","过敏源检测","视力保健"),
            55=>array("补钙补锌","挑食厌食","营养基础","培养健康饮食与习惯","喂养误区","牙齿护理","幼儿睡眠","眼睛护理与问题预防"),
            56=>array("预防生病","幼儿用药","学前幼儿常见疾病","幼儿常见传染病","麻疹疫苗"),
            57=>array("吮手指&啃手指","爱发脾气","社交","恋物","逆反心理","攀比心理","习惯养成","自闭","害羞/胆怯","夜尿","多动症"),
            58=>array("亲子阅读","智力培养","打骂孩子","情商培养","运动","入园准备","语言和识字","逻辑与艺术培养","性教育"),
            59=>array("家庭急救常识","常见的意外事故&救护","不同部位的意外&救护","学龄前幼儿的安全防护","防拐&防抢&防骗","安全出行手册"),
            60=>array("布置儿童房","选择画册&图书","玩具","自行车","衣物","喂养用品","生活用品"),
            61=>array("8种家庭游戏","锻炼孩子视觉空间智能的游戏","3～4岁宝宝的亲子游戏","4～5岁宝宝的亲子游戏","5～6岁宝宝的亲子游戏")
        );
        
        foreach($params as $key=>$param){
            foreach($param as $value){
                echo $key."-".$value."\n";
                $knowledgeService->addKnowledgeCateLabelRelation($key,$value);
            }
        }
        
        return true;
    }
    
}