<?php
$appOutPutMsg = array(
    //公用部分：
    500  => "所有参数错误，或服务端错误",
    501  => "蜜芽服务器维护中，敬请期待！",
    //524  => "蜜粉们太热情了，当前访问的用户过多，请稍后再试！",
    524  => "啊啊啊，每逢大促，排队结账。当前访问的用户过多，请稍后再试！",
    200  => "操作成功!",
    1000 => "请登录！",
    //蜜芽圈
    1101 => "发布失败",
    1102 => "点赞失败，已赞过",
    1103 => "评论失败",
    1104 => "发布内容违规，您已被管理员屏蔽",
    1105 => "分享失败,您在该平台已经分享过",
    1106 => "活动被管理员删除了，去看看其他活动吧",
    1107 => "该帖子不存在",
    1108 => "评论已删除",
    1109 => "该活动不存在",
    1110 => "您还没有赞过",
    1111 => "该活动已下线",
    1112 => "{|add_msg|}有敏感内容，发布失败",
    1114 => "请在蜜芽网站绑定手机号后再来评论",
    1115 => "千万蜜粉妈妈希望与你真诚交流，先绑定手机号咱们再开聊吧，等着你哦",
    1120 => "您访问的标签不存在",
    1125 => "您没有屏蔽和删除操作权限",
    
    //直播
    30000=>'您没有直播权限',
    30001=>'rongcloud service error',
    30002=>'qiniu service error',
    30003=>'live service error',
    30004=>'自己不能观看自己的直播',
    
	//红包
	1721 => "您已经领取过该红包，不能重复领取",
	1722 => "红包已领完",
	1723 => "红包领取失败",
);
