<?php
/**
 * 口碑差评词表
 */
$blackWord = array(
    '不是正品','退货','假货','垃圾','失望','退款','差劲','差评','投诉','破损',
    '粗糙','异味','慎重','骗子','坑人','欺骗','恶心','拉肚子','退回','骗人',
    '断层','失败','虚假','气愤','倒霉','上当','次品','变形','教训','气死',
    '不怎么样','线头','难吃','忽悠','疙瘩','褪色','糟糕','黑心','恶劣','抵制',
    '难闻','变质','气人','赔偿','简陋','质疑','寒心','封口','摆设','损坏',
    '受潮','卖假','敷衍','冒牌','退还','愤怒','抱歉','损失','漏气','受骗',
    '杳无音讯','一塌糊涂','无耻','缩水','磨损','毛刺','发霉','乱七八糟','模糊不清','删除',
    '欺人太甚','屏蔽','肠子','造假','不了了之','欺诈','搪塞','破烂','奸商','敷衍了事',
    '污渍','脱落','忍无可忍','缺德','奇葩','评理','垃圾桶','怪味','糟心','装糊涂',
    '以次充好','欺负','和稀泥','掺假','弄虚作假','渗漏','狗屁','售假','恼火','散落',
    '失信','渗出','破碎','恼火','狡辩','大失所望','扯淡','无赖','污迹','破产',
    '开裂','黑店','遥遥无期','心寒','泄漏','谴责','恐怖','假冒','挂羊头卖狗肉','发火',
    '鄙视','皱巴巴','说瞎话','强盗','强词夺理','假冒伪劣','划破','扯皮','诈骗','形同虚设',
    '销毁','破裂','破坏','赔钱','害人','惨不忍睹','不耐烦','蒙骗','麻痹','低劣',
    '心虚','陷阱','强买强卖','破破烂烂','破烂不堪','破旧','粗制滥造',
);